import re
from functions.CheraKe import build_question

pos_patterns_first_cause = [
    '.*(دلا?یل|عل[تل]|عامل|از دلایل|از عوامل|از علل|چرایی).*(است|هست|هستند|میباشد|می باشد|میباشند|می باشند|بود|بودند|باشد|باشند)',
    '(را نتیجه|رانتیجه).*(میدهند|میدهد|خواهند داد|خواهد داد|می دهد|می دهند|داد|داده|داده اند).*',
    '.*(منجر به|موجب|باعث|منجربه).*',
    '.*(نتایج).*(میتوان|می توان).*(اشاره کرد|برشمرد|بر شمرد).*',
    '.*(منجر به|سبب|منجربه).*(می شوند|میشوند|میشود|می شود|شد|شوند|شود).*'
]
question_seperator = [
    '(دلا?یل|عل[تل]|عامل|از دلایل|از عوامل|از علل|چرایی|است|هست|هستند|میباشد|می باشد|میباشند|می باشند|بود|بودند|باشد|باشند)',
    '(را نتیجه|رانتیجه|میدهند|میدهد|خواهند داد|خواهد داد|می دهد|می دهند|داد|داده|داده اند)',
    '(منجر به|موجب|باعث|منجربه)',
    '(نتایج|میتوان|می توان|اشاره کرد|برشمرد|بر شمرد)',
    '(منجر به|سبب|منجربه|می شوند|میشوند|میشود|می شود|شد|شوند|شود)'
]

pos_patterns_second_cause = [
    '.*(نتیجه|از نتایج|به خاطر).*(است|هست|هستند|میباشد|می باشد|میباشند|می باشند|بود|بودند|باشد|باشند)',
    '.*(به دلا?یل|ناشی از|زیرا|چون|برآمده از|برامده از).*',
    '.*(دلایل|علل|عوامل).*(میتوان|می توان).*(اشاره کرد|برشمرد|بر شمرد).*',
    '.*(اگر|چنانچه|چنان چه|در صورت|درصورت).*'
]
for x in pos_patterns_first_cause:
    print(x)


def causeEffect(input: str):
    questions = []
    answers = []
    for i, pattern in enumerate(pos_patterns_first_cause):
        if re.search(pattern, input) != None:
            input_pro = re.sub(question_seperator[i], '*$*', input).split('*$*')
            if len(input_pro) == 2:
                question_part, answer_part = input_pro[1], input_pro[0]
                questions.append(build_question("علت " + question_part + "چیست"))
                answers.append(answer_part)
    return questions, answers, True
